Revit 2027 API
RebarSpliceUtils.CanRebarBeSpliced(Rebar, RebarSpliceOptions, RebarSpliceGeometry) Method
 Verifies if the rebar can be spliced with the RebarSpliceGeometry.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RebarSpliceError CanRebarBeSpliced(
	Rebar rebar,
	RebarSpliceOptions spliceOptions,
	RebarSpliceGeometry spliceGeometry
)
Public Shared Function CanRebarBeSpliced (
	rebar As Rebar,
	spliceOptions As RebarSpliceOptions,
	spliceGeometry As RebarSpliceGeometry
) As RebarSpliceError
public:
static RebarSpliceError CanRebarBeSpliced(
	Rebar^ rebar,
	RebarSpliceOptions^ spliceOptions,
	RebarSpliceGeometry^ spliceGeometry
)
static member CanRebarBeSpliced :
        rebar : Rebar *
        spliceOptions : RebarSpliceOptions *
        spliceGeometry : RebarSpliceGeometry -> RebarSpliceError
Parameters
rebar Rebar
 The rebar to be spliced.
spliceOptions RebarSpliceOptions
 The RebarSpliceOptions.
spliceGeometry RebarSpliceGeometry
 The RebarSpliceGeometry.
Return Value
RebarSpliceError
 Will return RebarSpliceError.Success if it's possible to splice with point or other enum value corresponding to the error that occurred.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarSpliceUtils Class
CanRebarBeSpliced Overload
Autodesk.Revit.DB.Structure Namespace